Revit 2024 API
BIMExportOptions Class
 The base class for options used to export using ATF.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public class BIMExportOptions : IDisposable
Visual Basic
Public Class BIMExportOptions _
	Implements IDisposable
Visual C++
public ref class BIMExportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BIMExportOptions
 Autodesk.Revit.DB.OBJExportOptions
 Autodesk.Revit.DB.STLExportOptions
See Also
BIMExportOptions Members
Autodesk.Revit.DB Namespace